# SetThermalExpansionCoefficient Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset..::..SetThermalExpansionCoefficient Method
StructuralAsset Class See Also
---
Sets the thermal expansion coefficient of the asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetThermalExpansionCoefficient(
	double thermalExpCoeff
)
```

Visual Basic
---
```text
Public Sub SetThermalExpansionCoefficient ( _
	thermalExpCoeff As Double _
)
```

Visual C++
---
```text
public:
void SetThermalExpansionCoefficient(
	double thermalExpCoeff
)
```

# ### Parameters
thermalExpCoeff
    Type: System..::..Double
# Remarks
The thermal expansion coefficient is one-dimensional for wood-based and isotropic materials. This method sets the x, y, and z components to the same value. The value is in inverse Kelvin (1/K).
# See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace